var geoCoordMap = {
  '北京':[116.46,39.92],
  '广州':[113.23,23.16],
  '上海':[121.48,31.22],
  '重庆':[106.54,29.59],
  '成都':[104.06,30.67],
  '武汉':[114.31,30.52],
  '深圳':[114.07,22.62],
  '郑州':[113.65,34.76],
  '西安':[108.95,34.27],
  '杭州':[120.19,30.26],
  '长沙':[113,28.21],
  '南京':[118.78,32.04],
  '南昌':[115.89,28.68],
  '沈阳':[123.38,41.8],
  '昆明':[102.73,25.04],
  '福州':[119.3,26.08],
  '青岛':[120.33,36.07],
  '南宁':[108.33,22.84],
  '天津':[117.2,39.13],
  '大连':[121.62,38.92],
  '石家庄':[114.48,38.03],
  '合肥':[117.27,31.86],
  '兰州':[103.73,36.03],
  '厦门':[118.1,24.46],
  '哈尔滨':[126.63,45.75],
  '苏州':[120.62,31.32],
  '长春':[125.35,43.88],
  '济南':[117,36.65],
  '温州':[120.65,28.01],
}
var city = [
  {
    name: '北京',
    value: '21.85'
  },
  {
    name: '广州',
    value: '9.28'
  },
  {
    name: '上海',
    value: '9.15'
  },
  {
    name: '重庆',
    value: '8.84'
  },
  {
    name: '成都',
    value: '8.07'
  },
  {
    name: '武汉',
    value: '6.19'
  },
  {
    name: '深圳',
    value: '5.78'
  },
  {
    name: '郑州',
    value: '5.72'
  },
  {
    name: '西安',
    value: '4.29'
  },
  {
    name: '杭州',
    value: '3.37'
  },
  {
    name: '郑州',
    value: '5.72'
  },
  {
    name: '长沙',
    value: '2.67'
  },
  {
    name: '南京',
    value: '2.40'
  },
  {
    name: '南昌',
    value: '1.82'
  },
  {
    name: '沈阳',
    value: '1.02'
  },
  {
    name: '昆明',
    value: '0.97'
  },
  {
    name: '福州',
    value: '0.82'
  },
  {
    name: '青岛',
    value: '0.80'
  },
  {
    name: '南宁',
    value: '0.77'
  },
  {
    name: '天津',
    value: '0.61'
  },
  {
    name: '大连',
    value: '0.55'
  },
  {
    name: '石家庄',
    value: '0.52'
  },
  {
    name: '合肥',
    value: '0.49'
  },
  {
    name: '兰州',
    value: '0.49'
  },
  {
    name: '厦门',
    value: '0.44'
  },
  {
    name: '哈尔滨',
    value: '0.43'
  },
  {
    name: '苏州',
    value: '0.39'
  },
  {
    name: '长春',
    value: '0.38'
  },
  {
    name: '济南',
    value: '0.37'
  },
  {
    name: '温州',
    value: '0.33'
  }
]
